Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
ACAPI::MEP::v1::PipingPort Class Referencefinal
MEP Element Manager
The PipingPort represents a connection point of a pipe segment. More...
#include <MEPPipingPort.hpp>
 Inheritance diagram for ACAPI::MEP::v1::PipingPort:
 Public Member Functions
~PipingPort ()
double  | GetOuterDiameter () const
double  | GetWallThickness () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
~Modifier ()
void  | SetOuterDiameter (double diameter)
Sets the outer diameter of the port.
void  | SetWallThickness (double thickness)
Sets the thickness of the port's wall.
 Public Member Functions inherited from ACAPI::MEP::v1::PortBase
bool  | Exists () const
GS::UniString  | GetName () const
Orientation  | GetOrientation () const
double  | GetWidth () const
double  | GetHeight () const
ConnectorShape  | GetShape () const
API_Coord3D  | GetPosition () const
Domain  | GetDomain () const
API_AttributeIndex  | GetMEPSystem () const
std::optional< UniqueID >  | GetConnectedPortId () const
std::optional< UniqueID >  | GetConnectedMEPElementId () const
UniqueID  | GetMEPElementId () const
bool  | IsConnected () const
Result< bool >  | IsConnectable (const UniqueID &portId) const
Checks if the Port is connectable to another Port which has the UniqueID of the parameter.
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
~Modifier ()
void  | SetWidth (double width)
Sets the width of the port.
void  | SetHeight (double height)
Sets the height of the port.
void  | SetShape (ConnectorShape shape)
Sets the shape of the port.
void  | SetMEPSystem (const API_AttributeIndex &attributeIndex)
Sets the MEPSystem attribute of a Port.
 Static Public Member Functions
static Result< PipingPort >  | Get (const UniqueID &uniqueId)
Returns a PipingPort.
 Public Attributes
friend  | PipingPort
 Public Attributes inherited from ACAPI::MEP::v1::PortBase
friend  | PortBase
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::v1::PortBase
PortBase (std::shared_ptr< Impl::IPortBaseImpl >)
~PortBase ()
Modifier (PortBase &)
Detailed Description
The PipingPort represents a connection point of a pipe segment.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at PortBase
Constructor & Destructor Documentation
◆ ~PipingPort()
 ACAPI::MEP::v1::PipingPort::~PipingPort  |  ( |   | )
◆ ~Modifier()
 ACAPI::MEP::v1::PipingPort::~Modifier  |  ( |   | )
Member Function Documentation
◆ Get()
 static Result< PipingPort > ACAPI::MEP::v1::PipingPort::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a PipingPort.
Parameters
uniqueId | The UniqueID of the requested PipingPort.
Returns
If the uniqueId belongs to a PipingPort, returns the object associated to it, otherwise Error.
◆ GetOuterDiameter()
 double ACAPI::MEP::v1::PipingPort::GetOuterDiameter  |  ( |   | ) |   const
Returns
Returns the outer diameter of the PipingPort.
◆ GetWallThickness()
 double ACAPI::MEP::v1::PipingPort::GetWallThickness  |  ( |   | ) |   const
Returns
Returns the wall thickness of the PipingPort.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::PipingPort::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetOuterDiameter()
 void ACAPI::MEP::v1::PipingPort::SetOuterDiameter  |  ( |  double  |  diameter | )
Sets the outer diameter of the port.
Parameters
diameter | The value to be set.
◆ SetWallThickness()
 void ACAPI::MEP::v1::PipingPort::SetWallThickness  |  ( |  double  |  thickness | )
Sets the thickness of the port's wall.
Parameters
thickness | The value to be set.
Member Data Documentation
◆ PipingPort
 friend ACAPI::MEP::v1::PipingPort::PipingPort